Activate Method
 Activates the symbol to ensure that its geometry is accessible.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2014
 Syntax
  C#
public void Activate()
  Visual Basic
Public Sub Activate
  Visual C++
public:
void Activate()
 Remarks
 Symbols that are not used in the document may be deactivated to conserve memory and regeneration time. When the symbol is inactive, its geometry is empty and should not be accessed. In order to access geometry of a symbol that is not active in the document, first check its  IsActive  property. Note that until the document is regenerated, the newly activated symbol's geometry will still be empty.
 See Also
  FamilySymbol Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →